import sys 
import os
sys.path.append(os.path.dirname(os.path.abspath(__file__)))
from rich.console import Console
from setup import setup

console = Console()

if __name__ == "__main__":
    setup()
    A = "[bold cyan]"
    
    logo = [
        "",

        f"{A} ██████╗██████╗  █████╗ ██╗    ██╗██╗     ███╗   ███╗██╗███╗   ██╗██████╗ ",
        f"{A}██╔════╝██╔══██╗██╔══██╗██║    ██║██║     ████╗ ████║██║████╗  ██║██╔══██╗",
        f"{A}██║     ██████╔╝███████║██║ █╗ ██║██║     ██╔████╔██║██║██╔██╗ ██║██║  ██║",
        f"{A}██║     ██╔══██╗██╔══██║██║███╗██║██║     ██║╚██╔╝██║██║██║╚██╗██║██║  ██║",
        f"{A}╚██████╗██║  ██║██║  ██║╚███╔███╔╝███████╗██║ ╚═╝ ██║██║██║ ╚████║██████╔╝",
        f"{A} ╚═════╝╚═╝  ╚═╝╚═╝  ╚═╝ ╚══╝╚══╝ ╚══════╝╚═╝     ╚═╝╚═╝╚═╝  ╚═══╝╚═════╝ ",
        
        ""
        ]
    for line in logo:
        console.print(line)
    url = input("> Enter website URL : ").strip()
    from agent.agent import run_agent
    run_agent(url)